## Terraform Plan — ✅ No changes

| Step | Status |
|------|--------|
| Init | `success` |
| Validate | `success` |
| Plan | `success` |

> **Merging this PR will automatically trigger `terraform apply` + Teleport RBAC apply** via the `production` environment gate.

<details><summary>Show Plan Output</summary>

```hcl
data.aws_ami.ubuntu: Reading...
data.aws_route53_zone.teleport: Reading...
data.aws_ami.ubuntu: Read complete after 0s [id=ami-0d76b909de1a0595d]
data.aws_route53_zone.teleport: Read complete after 0s [id=Z013845130G68TTJ5HE4R]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_instance_profile.ec2 will be created
  + resource "aws_iam_instance_profile" "ec2" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "grant-tam-ec2-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "grant-tam-ec2-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_instance_profile.ssh_node will be created
  + resource "aws_iam_instance_profile" "ssh_node" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "grant-tam-ssh-node-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "grant-tam-ssh-node-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.ec2 will be created
  + resource "aws_iam_role" "ec2" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "grant-tam-ec2-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        }
      + tags_all              = {
          + "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ssh_node will be created
  + resource "aws_iam_role" "ssh_node" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "grant-tam-ssh-node-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name"                          = "grant-tam-ssh-node-role"
          + "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        }
      + tags_all              = {
          + "Name"                          = "grant-tam-ssh-node-role"
          + "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.s3_sessions will be created
  + resource "aws_iam_role_policy" "s3_sessions" {
      + id          = (known after apply)
      + name        = "grant-tam-s3-sessions-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.secrets_manager will be created
  + resource "aws_iam_role_policy" "secrets_manager" {
      + id          = (known after apply)
      + name        = "grant-tam-secrets-manager-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.ssh_node_teleport will be created
  + resource "aws_iam_role_policy" "ssh_node_teleport" {
      + id          = (known after apply)
      + name        = "grant-tam-ssh-node-teleport-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "TeleportNodeLabels"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_instance.master will be created
  + resource "aws_instance" "master" {
      + ami                                  = "ami-0d76b909de1a0595d"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "grant-tam-ec2-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "grant-tam-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = "172.49.20.230"
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = false
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"                          = "grant-tam-master"
          + "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        }
      + tags_all                             = {
          + "Name"                          = "grant-tam-master"
          + "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (sensitive value)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name"                          = "grant-tam-master-volume"
          + "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        }
      + vpc_security_group_ids               = (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 80
          + volume_type           = "gp3"
        }
    }

  # aws_instance.node1 will be created
  + resource "aws_instance" "node1" {
      + ami                                  = "ami-0d76b909de1a0595d"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "grant-tam-ec2-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "grant-tam-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = "172.49.20.231"
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = false
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"                          = "grant-tam-node1"
          + "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        }
      + tags_all                             = {
          + "Name"                          = "grant-tam-node1"
          + "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "0eda6fa9b0287f4f81b88c273a326e87a71d1911"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name"                          = "grant-tam-node1-volume"
          + "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        }
      + vpc_security_group_ids               = (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 80
          + volume_type           = "gp3"
        }
    }

  # aws_instance.node2 will be created
  + resource "aws_instance" "node2" {
      + ami                                  = "ami-0d76b909de1a0595d"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "grant-tam-ec2-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "grant-tam-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = "172.49.20.232"
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = false
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"                          = "grant-tam-node2"
          + "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        }
      + tags_all                             = {
          + "Name"                          = "grant-tam-node2"
          + "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "0eda6fa9b0287f4f81b88c273a326e87a71d1911"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name"                          = "grant-tam-node2-volume"
          + "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        }
      + vpc_security_group_ids               = (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 80
          + volume_type           = "gp3"
        }
    }

  # aws_instance.ssh_node_1 will be created
  + resource "aws_instance" "ssh_node_1" {
      + ami                                  = "ami-0d76b909de1a0595d"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "grant-tam-ssh-node-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "grant-tam-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"                          = "grant-tam-ssh-node-1"
          + "description"                   = "Teleport SSH demo node — IAM auto-enrollment"
          + "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
          + "team"                          = "platform"
        }
      + tags_all                             = {
          + "Name"                          = "grant-tam-ssh-node-1"
          + "description"                   = "Teleport SSH demo node — IAM auto-enrollment"
          + "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
          + "team"                          = "platform"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "1b6c796721d4b38855aaf5ed60b5b39fe00d8924"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name"                          = "grant-tam-ssh-node-1-volume"
          + "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        }
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "grant-tam-IGW"
        }
      + tags_all = {
          + "Name" = "grant-tam-IGW"
        }
      + vpc_id   = (known after apply)
    }

  # aws_key_pair.main will be created
  + resource "aws_key_pair" "main" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "grant-tam-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags_all        = (known after apply)
    }

  # aws_lb.teleport will be created
  + resource "aws_lb" "teleport" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + dns_name                                                     = (known after apply)
      + dns_record_client_routing_policy                             = "any_availability_zone"
      + enable_cross_zone_load_balancing                             = true
      + enable_deletion_protection                                   = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "network"
      + name                                                         = "grant-tam-teleport-nlb"
      + name_prefix                                                  = (known after apply)
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Name"                          = "grant-tam-teleport-nlb"
          + "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        }
      + tags_all                                                     = {
          + "Name"                          = "grant-tam-teleport-nlb"
          + "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        }
      + vpc_id                                                       = (known after apply)
      + zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.teleport_443 will be created
  + resource "aws_lb_listener" "teleport_443" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "TCP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.teleport will be created
  + resource "aws_lb_target_group" "teleport" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "grant-tam-teleport-tg"
      + name_prefix                        = (known after apply)
      + port                               = 32443
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "TCP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"                          = "grant-tam-teleport-tg"
          + "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        }
      + tags_all                           = {
          + "Name"                          = "grant-tam-teleport-tg"
          + "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 10
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = "32443"
          + protocol            = "TCP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 2
        }
    }

  # aws_lb_target_group_attachment.master will be created
  + resource "aws_lb_target_group_attachment" "master" {
      + id               = (known after apply)
      + port             = 32443
      + target_group_arn = (known after apply)
      + target_id        = "172.49.20.230"
    }

  # aws_lb_target_group_attachment.node1 will be created
  + resource "aws_lb_target_group_attachment" "node1" {
      + id               = (known after apply)
      + port             = 32443
      + target_group_arn = (known after apply)
      + target_id        = "172.49.20.231"
    }

  # aws_lb_target_group_attachment.node2 will be created
  + resource "aws_lb_target_group_attachment" "node2" {
      + id               = (known after apply)
      + port             = 32443
      + target_group_arn = (known after apply)
      + target_id        = "172.49.20.232"
    }

  # aws_route53_record.teleport will be created
  + resource "aws_route53_record" "teleport" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "grant-tam-teleport.gvteleport.com"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z013845130G68TTJ5HE4R"
    }

  # aws_route53_record.teleport_wildcard will be created
  + resource "aws_route53_record" "teleport_wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.grant-tam-teleport.gvteleport.com"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z013845130G68TTJ5HE4R"
    }

  # aws_route_table.main will be created
  + resource "aws_route_table" "main" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "grant-tam-RT"
        }
      + tags_all         = {
          + "Name" = "grant-tam-RT"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.main will be created
  + resource "aws_route_table_association" "main" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket.teleport_sessions will be created
  + resource "aws_s3_bucket" "teleport_sessions" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "grant-tam-teleport-sessions"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"                          = "grant-tam-teleport-sessions"
          + "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        }
      + tags_all                    = {
          + "Name"                          = "grant-tam-teleport-sessions"
          + "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_public_access_block.teleport_sessions will be created
  + resource "aws_s3_bucket_public_access_block" "teleport_sessions" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.teleport_sessions will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "teleport_sessions" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_versioning.teleport_sessions will be created
  + resource "aws_s3_bucket_versioning" "teleport_sessions" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_secretsmanager_secret.teleport_license will be created
  + resource "aws_secretsmanager_secret" "teleport_license" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "grant-tam/teleport/license"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "Name"                          = "grant-tam-teleport-license"
          + "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        }
      + tags_all                       = {
          + "Name"                          = "grant-tam-teleport-license"
          + "instance_metadata_tagging_req" = "grant.voss@goteleport.com"
        }
    }

  # aws_secretsmanager_secret_version.teleport_license will be created
  + resource "aws_secretsmanager_secret_version" "teleport_license" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # aws_security_group.main will be created
  + resource "aws_security_group" "main" {
      + arn                    = (known after apply)
      + description            = "grant-tam Security Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS to Teleport"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Teleport NodePort"
              + from_port        = 32443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 32443
            },
          + {
              + cidr_blocks      = [
                  + "136.25.0.29/32",
                  + "4.79.223.218/32",
                ]
              + description      = "SSH from customer"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = []
              + description      = "All traffic within cluster"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
      + name                   = "grant-tam-SG"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "grant-tam-SG"
        }
      + tags_all               = {
          + "Name" = "grant-tam-SG"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.main will be created
  + resource "aws_subnet" "main" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.49.20.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "grant-tam-subnet-1"
        }
      + tags_all                                       = {
          + "Name" = "grant-tam-subnet-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.49.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "grant-tam-vpc1"
        }
      + tags_all                             = {
          + "Name" = "grant-tam-vpc1"
        }
    }

  # local_sensitive_file.private_key will be created
  + resource "local_sensitive_file" "private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0600"
      + filename             = "./grant-tam-key.pem"
      + id                   = (known after apply)
    }

  # tls_private_key.main will be created
  + resource "tls_private_key" "main" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

Plan: 34 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + master_private_ip      = "172.49.20.230"
  + master_public_ip       = (known after apply)
  + nlb_dns_name           = (known after apply)
  + node1_private_ip       = "172.49.20.231"
  + node2_private_ip       = "172.49.20.232"
  + private_key_path       = "./grant-tam-key.pem"
  + private_key_pem        = (known after apply)
  + sessions_bucket        = "grant-tam-teleport-sessions"
  + ssh_node_1_private_ip  = (known after apply)
  + ssh_node_1_public_ip   = (known after apply)
  + teleport_dns           = (known after apply)
  + teleport_oidc_role_arn = "arn:aws:iam::278576220453:role/grant-tam-oidc-role"
  + teleport_wildcard_dns  = (known after apply)
  + ubuntu_ami_id          = "ami-0d76b909de1a0595d"
  + ubuntu_ami_name        = "ubuntu/images/hvm-ssd-gp3/ubuntu-noble-24.04-amd64-server-20260313"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
</details>